{
  "header": {
    "chess": "Шахматы",
    "shatranj": "Шатрандж",
    "old_chess": "Старые шахматы",
    "extended_chess": "Розширенные шахматы",
    "dinozavr_chess": "Эра динозавров",
    "position": "Позиция",
    "custom_position": "Своя позиция",
    "hi": "Привет,",
    "info": "Информация",
    "login": "Войти",
    "register": "Регистрация",
    "logout": "Выйти"
  },
  "custom_panel": {
    "standart_pieces": "Стандартные фигуры",
    "old_pieces": "Старые фигуры",
    "special_pieces": "Специальные фигуры",
    "reset_colors": "Сбросить цвета",
    "change_color": "Изменить цвет",
    "rotate_board": "Повернуть доску",
    "reset_position": "Сбросить позицию"
  },
  "info_panel": {
    "navigation": "Навигация"
  },
  "captured_pieces": {
    "white": "Белые",
    "black": "Черные",
    "white_captures": "Белые забрали:",
    "black_captures": "Черные забрали:"
  },
  "style_panel": {
    "change_style": "Изменить стиль"
  },
  "form_panel": {
    "name": "Имя",
    "email": "Почта",
    "password": "Пароль",
    "register": "Регистрация",
    "login": "Войти"
  },
  "game_info_panel": {
    "white_wins": "Белые победили",
    "black_wins": "Черные победили",
    "white_baring_king": "Белые побеждают, оголив короля!",
    "black_baring_king": "Черные побеждают, оголив короля!",
    "draw": "Ничья",
    "turn": "Ход: ",
    "start": "Старт",
    "start_again": "Начать заново",
    "choose_color": "Выберите цвет"
  },
  "validation": {
    "error_email": "Такая почта уже существует",
    "error_unauthorized": "Неавторизованный",
    "email": "Почта должна быть корректной",
    "name_min": "Имя должно быть не менее 5 символов",
    "name_max": "Имя должно быть не более 64 символов",
    "password_min": "Пароль слишком короткий (минимум 8 знаков)",
    "password_max": "Пароль слишком длинный (максимум 125 знаков)",
    "required": "Это поле обязательно"
  },
  "home": {
    "home_caption": "Главная страница",
    "welcome_message": "Добро пожаловать в наш шахматный портал! Исследуйте мир классических шахмат и древнего шатранджа, создавайте свои собственные позиции и совершенствуйте свои навыки игры. Присоединяйтесь к нам и погрузитесь в увлекательный мир шахмат!"
  },
  "pieces": {
    "desc_caption": "Описание",
    "history_caption": "История",
    "pawn": {
        "name": "Пешка",
        "desc": "Ходит на одну клетку вперед. На первом ходу может ходить на две клетки. Бьет по диагонали. Может превращаться в любую фигуру (кроме короля), когда достигает последней клетки. Имеет силу - 1 пешка.",
        "history": "Появился в индийских шахах (Чатуранга). В Шатрандж мог превращяться только в фирзана (радника). Пешка всегда символизировала пехоту или солдат на поле боя. С развитием шахмат в Европе, пешка сохранила свой основной ход, но получила возможность превращения в любые фигуры при достижении последней линии, что значительно повысило её стратегическое значение в игре."
    },
    "horse": {
        "name": "Конь",
        "desc": "Ходит буквой 'Г' (две клетки прямо и одна вбок). Может перепрыгивать через фигуры. Не имеет большой дальнобойности, но благодаря способности прыгать, может быть очень сильным в закрытых позициях. Имеет силу - 3 пешки.",
        "history": "Появился в индийских шахах (Чатуранга) и назывался 'Ашва', что означает - 'конь'. В арабском Шатрандже эта фигура получила название 'Фарас', что означает - 'военный всадник'. Конь всегда сохранял свой уникальный ход во всех версиях шахов, поскольку его способность перестригивать через фигуры делала его очень ценным в игре. В европейских шахах конь стал одной из самых важных фигур благодаря своей способности проникать в оборону соперника."
    },
    "bishop": {
        "name": "Слон",
        "desc": "Ходит по диагонали на любое количество клеток. Не может перепрыгивать через фигуры. Имеет силу - 3 пешки.",
        "history": "Появился в индийских шахах (Чатуранга). Назывался 'Алфил' (от арабского 'al-fil'), что означает - 'слон'. Ходил через одну клетку по диагонали, прыгая через фигуры (подобно коню), но через прыжки по диагонали, он имел ограниченную мобильность (мог достичь только 8 клеток из 64 на доске). Он был примерно в 2-3 раза слабее коня. С развитием шахмат в Европе, ход слона был изменен на современный (через очень ограниченную мобильность), что позволило ему двигаться по любому количеству клеток по диагонали, значительно повысив его силу и мобильность. Но из-за изменения хода, он потерял способность перепрыгивать через фигуры."
    },
    "rook": {
        "name": "Ладья",
        "desc": "Ходит по вертикали и горизонтали на любое количество клеток. Не может перепрыгивать через фигуры. Может участвовать в рокировке. Имеет силу - 5 пешек.",
        "history": "Появилась в индийских шахматах (Чатуранга) и называлась 'Ратха', что означает - 'колесница'. На тот момент, она была самой сильной фигурой в шахматах. Позже, фигура попала в Европу, где получила современное название 'Ладья'. Ход этой фигуры не изменился с момента её появления, изменились лишь её название и внешний вид."
    },
    "ferz": {
        "name": "Ферзь",
        "desc": "Ходит по диагонали и вертикали/горизонтали на любое количество клеток (объединяет ходы слона и ладьи). Не может перепрыгивать через фигуры. Имеет силу - 9 пешек.",
        "history": "Впервые появился в Шатрандже, где назывался фирзан (от персидского 'farzin' - советник или визирь). В Шатрандже мог ходить только на одну клетку по диагонали, что делало его самой бесполезной фигурой на доске. С развитием шахмат в Европе, ход ферзя был значительно расширен до современного, что позволило ему двигаться по любому количеству клеток по диагонали, вертикали и горизонтали. Это сделало его самой сильной фигурой в шахматах."
    },
    "king": {
        "name": "Король",
        "desc": "Ходит на одну клетку в любом направлении. Имеет уникальный ход - рокировку (специальный ход с ладьёй). Не имеет силы в традиционном понимании, поскольку его захват означает конец игры. Но по силе хода, он равен примерно 3-4 пешкам.",
        "history": "Появился в индийских шахматах (Чатуранга) и назывался 'Раджа', что означает - 'король'. В арабских шахматах эта фигура получила название 'Шах', что означает - 'король'. Король всегда был центральной фигурой в шахматах, поскольку цель игры заключается в его защите. С развитием шахмат в Европе, ход короля остался неизменным, но была добавлена возможность рокировки, что позволяет королю и ладье одновременно двигаться для улучшения защиты короля."
    },
    "tank": {
        "name": "Танк",
        "desc": "Ходит через одну клетку по вертикали/горизонталі. Может перепрыгивать через фигуры подобно коню, но имеет ограниченную мобильность (может пойти только на 16 из 64 полей). Имеет силу приблизительно - 2 пешки.",
        "history": "Встречался в некоторых очень ранних вариантах шахмат, таких как шахматы Тамерлана. На древнем арабском языке название этой фигуры относилось к типу средневековых осадных машин, предназначенных для укрытия людей, копающих яму во вражеских укреплениях."
    },
    "camel": {
        "name": "Верблюд",
        "desc": "Ход верблюда напоминает удлиненный ход коня: на три клетки по горизонтали или вертикали, потом сразу же поворачивает под прямым углом и делает еще один шаг, как и конь, может перепрыгивать через фигуры. Огарниченный мобильностю - может пойти на 32 клетки из 64. Имеет силу - 2 пешки.",
        "history": "Встречался в некоторых очень ранних вариантах шахмат, таких как шахматы Тамерлана."
    },
    "zebra": {
        "name": "Зебра",
        "desc": "Ход зебры напоминает удлиненный ход коня: на три клетки по горизонтали или вертикали, потом сразу же поворачивает под прямым углом и делает еще два шага, как и конь, может перепрыгивать через фигуры. Через свой длинный ход, зебра имеет плохую маневренность, поэтому она имеет силу - 2 пешки. На доске большого размера, она была бы по силе как конь, но на стандартной доске 8x8, её сила ограничена.",
        "history": "Встречалася в некоторых очень ранних вариантах шахмат, таких как Grant Acedrex."
    },
    "wazir": {
        "name": "Визир",
        "desc": "Ходит на одну клетку вертикально или горизонтально. Не может перепрыгивать фигуры. Имеет силу - 1-2 пешки.",
        "history": "Встречался в некоторых очень ранних вариантах шахмат, таких как шахматы Курьера."
    },
    "giraffe": {
        "name": "Жираф",
        "desc": "Ход жирафа начинается с одного шага по диагонали (жираф не может остановиться на этом шаге), потом ходит на минимум 3 клетки по вертикали/горизонтали. Не может перепрыгивать фигуры. Имеет силу - 4 пешки.",
        "history": "Встречался в некоторых очень ранних вариантах шахмат, таких как шахматы Тамерлана."
    },
    "rukh": {
        "name": "Рух",
        "desc": "Рух перемещается на один шаг по диагонали, затем на множество клеток по вертикали/горизонтали. Не может перепрыгивать фигуры. Имеет силу - 10 пешек.",
        "history": "Встречался в некоторых очень ранних вариантах шахмат, такие как Grant Acedrex."
    },
    "dinozavr": {
        "name": "Динозавр",
        "desc": "Может ходить в любом направлении (не только как ферзь, а ще как и конь но дальнобойный).Не может перепрыгивать фигуры. Это очень мощная фигура, так как контролирует почти всю доску, по этому он имеет силу - 19 пешек (условно).",
        "history": "Это специальна фигура, которой нет в обычных шахматах или их вариантах."
    },
    "checkers": {
        "name": "Шашка",
        "desc": "Ходит на одну клетку по диагонали вперед, бьет прыгая через фигуру по диагонали в любом направлении. Не может перепрыгивать фигуры, когда не может бить. Ёё нет в шахматах, но ёё силу можно оценить в 0,5 пешки, так как она очень медленная и предсказуемая.",
        "history": "Это специальна фигура, которой нет в обычных шахматах или их вариантах."
    }
  }
}