{
  "header": {
    "chess": "Шахи",
    "shatranj": "Шатрандж",
    "old_chess": "Старі шахи",
    "extended_chess": "Розширенні шахи",
    "dinozavr_chess": "Ера динозаврів",
    "position": "Позиція",
    "custom_position": "Своя позиція",
    "hi": "Привіт,",
    "info": "Інформація",
    "login": "Увійти",
    "register": "Реєстрація",
    "logout": "Вийти"
  },
  "custom_panel": {
    "standart_pieces": "Стандартні фігури",
    "old_pieces": "Старі фігури",
    "special_pieces": "Спеціальні фігури",
    "reset_colors": "Скинути кольори",
    "change_color": "Змінити колір",
    "rotate_board": "Повернути дошку",
    "reset_position": "Скинути позицію"
  },
  "info_panel": {
    "navigation": "Навігація"
  },
  "captured_pieces": {
    "white": "Білі",
    "black": "Чорні"
  },
  "style_panel": {
    "change_style": "Змінити стиль"
  },
  "form_panel": {
    "name": "І'мя",
    "email": "Пошта",
    "password": "Пароль",
    "register": "Реєстрація",
    "login": "Увійти"
  },
  "game_info_panel": {
    "white_wins": "Білі перемогли",
    "black_wins": "Чорні перемогли",
    "white_baring_king": "Білі перемагають, оголивши короля!",
    "black_baring_king": "Чорні перемагають, оголивши короля!",
    "draw": "Нічия",
    "turn": "Хід: ",
    "start": "Старт",
    "start_again": "Почати знову",
    "choose_color": "Виберіть колір"
  },
  "validation": {
    "error_email": "Така пошта вже існує",
    "error_unauthorized": "Неавторизований",
    "email": "Пошта має бути коректною",
    "name_min": "І'мя має бути не менше 5 символів",
    "name_max": "І'мя має бути не більше 64 символів",
    "password_min": "Пароль надто короткий (мінімум 8 знаків)",
    "password_max": "Пароль надто довгий (максимум 125 знаків)",
    "required": "Це поле обов'язково"
  },
  "home": {
    "home_caption": "Головна сторінка",
    "welcome_message": "Ласкаво просимо на наш шаховий портал! Досліджуйте світ класичних шахів та давнього шатранджа, створюйте власні позиції та вдосконалюйте свої навички гри. Приєднуйтесь до нас і пориньте у захоплюючий світ шахів!"
  },
  "pieces": {
    "desc_caption": "Опис",
    "history_caption": "Історія",
    "pawn": {
        "name": "Пішак",
        "desc": "Ходить на одну клітинку вперед. На першому ході може ходити на дві клітинки. Б'є по діагоналі. Може перетворюватися на будь-яку фігуру (крім короля), коли досягає останньої клітинки. Має силу - 1 пішак.",
        "history": "З'явився в індійських шахах (Чатуранга). В Шатранджі міг перетворюватися лише на фірзана (радника). Пішак завжди символізував піхоту або солдатів на полі бою. З розвитком шахів у Європі, пішак зберіг свій основний хід, але отримав можливість перетворення на будь-які фігури при досягненні останньої лінії, що значно підвищило його стратегічне значення в грі."
    },
    "horse": {
        "name": "Кінь",
        "desc": "Ходить буквою 'Г' (дві клітинки прямо і одна вбік). Може перестрибувати через фігури. Не має великої дальнобійності, але через здатність стрибати, може бути дуже сильним у закритих позиціях. Має силу - 3 пішаки.",
        "history": "З'явився в індійських шахах (Чатуранга) і називався 'Ашва', що означає - 'кінь'. У арабських шахах ця фігура отримала назву 'Фарас', що  означає - 'військовий вершник'. Кінь завжди зберігав свій унікальний хід у всіх версіях шахів, оскільки його здатність перестрибувати через фігури робила його дуже цінним у грі. У європейських шахах кінь став однією з найважливіших фігур через свою здатність проникати в оборону супротивника."
    },
    "bishop": {
        "name": "Слон",
        "desc": "Ходить по діагоналі на будь-яку кількість клітинок. Не може стрибати через фігури. Має силу - 3 пішаки.",
        "history": "З'явився в індійських шахах (Чатуранга). Називався 'Алфіл' (від арабського 'al-fil'), що означає - 'слон'. Ходив через одну клітинку по діагоналі, стрибаючи через фігури (подібно до коня), але через стрибки по діагоналі, він мав обмежену мобільність (міг досягнути лише 8 клітинок з 64 на дошці). Він був приблизно в 2-3 рази слабший за коня. З розвитком шахів у Європі, хід слона був змінений на сучасний (через дуже обмежену мобільність), що дозволило йому рухатися по будь-якій кількості клітинок по діагоналі, значно підвищивши його силу та мобільність. Але через зміну ходу, він втратив здатність перестрибувати через фігури."
    },
    "rook": {
        "name": "Тура",
        "desc": "Ходить по вертикалі та горизонталі на будь-яку кількість клітинок. Не може стрибати через фігури. Може брати участь у рокіровці. Має силу - 5 пішаків.",
        "history": "З'явилася в індійських шахах (Чатуранга) і називалася 'Ратха', що означає - 'колісниця'. Потім була адаптована в арабських шахах як 'Рух' - що символізувало птаха Рух, який використовувся як вид військ. На той час, вона була найсильнішою фігурою в шахах. Пізніше, фігура попала в Європу, де отримала сучасну назву 'Тура'. Хід цієї фігури не змінився з часів її появи, змінилися лише її назва та зовнішній вигляд."
    },
    "ferz": {
        "name": "Ферзь",
        "desc": "Ходить по діагоналі і вертикалі/горизонталі на будь-яку кількість клітинок (поєднує ходи слона і тури). Не може стрибати через фігури. Має силу - 9 пішаків.",
        "history": "Вперше з'явився в Шатранджі, де називався фірзан (від перського 'farzin' - радник або візир). У Шатранджі міг ходити лише на одну клітинку по діагоналі, що робило його самою безпомічною фігурою на дошці. З розвитком шахів у Європі, хід ферзя був значно розширений до сучасного, що дозволило йому рухатися по будь-якій кількості клітинок по діагоналі, вертикалі та горизонталі. Це зробило його найсильнішою фігурою в шахах."
    },
    "king": {
        "name": "Король",
        "desc": "Ходить на одну клітинку в будь-якому напрямку. Має унікальний хід - рокіровку (спеціальний хід з турою). Не має сили в традиційному розумінні, оскільки його захоплення означає кінець гри. Але по силі ходу, він дорівнює приблизно 3-4 пішакам.",
        "history": "З'явився в індійських шахах (Чатуранга) і називався 'Раджа', що означає - 'король'. У арабських шахах ця фігура отримала назву 'Шах', що означає - 'король'. Король завжди був центральною фігурою в шахах, оскільки мета гри полягає в його захисті. З розвитком шахів у Європі, хід короля залишився незмінним, але була додана можливість рокіровки, що дозволяє королю та турі одночасно рухатися для покращення захисту короля."
    },
    "tank": {
        "name": "Танк",
        "desc": "Ходить через одну клітинку по вертикалі/горизонталі. Може стрибати через фігури подібно до коня, але має обмежену мобільність (може піти лише на 16 з 64 полів). Має силу приблизно - 2 пішаки.",
        "history": "Зустрічався в деяких дуже ранніх варіантах шахів, такі як шахи Тамерлана. Давньою арабською мовою назва цієї фігури відносилася до типу середньовічних облогових машин, призначених для укриття людей, що копають яму у ворожих укріпленнях."
    },
    "camel": {
        "name": "Верблюд",
        "desc": "Хід верблюда нагадує подовжений хід коня: на три клітини по горизонталі або вертикалі, потім відразу ж повертає під прямим кутом і робить ще один крок, як і кінь, може перестрибувати через фігури. Обмежений мобільністю - може досягти 32 клітинок з 64. Має силу - 2 пішаки.",
        "history": "Зустрічався в деяких дуже ранніх варіантах шахів, такі як шахи Тамерлана."
    },
    "giraffe": {
        "name": "Жираф",
        "desc": "Хід жирафу починається з одного кроку по діагоналі (жираф не може зупинитися на цьому кроці), потім ходить на безліч клітинок по вертикалі/горизонталі (подібно до тури). Не може перестрибувати фігури. Має силу - 7 пішаків.",
        "history": "Зустрічався в деяких дуже ранніх варіантах шахів, такі як шахи Тамерлана."
    },
    "dinozavr": {
        "name": "Динозавр",
        "desc": "Може ходити у будь-якому напрямку (не тільки як ферзь, а ще як і кінь але далекобійний).Не може перестрибувати фігури. Це дуже потужна фігура, оскільки контролює майже всю дошку, тому він має силу - 19 пішаків (умовно).",
        "history": "Це спеціальна фігура, якої не має в звичайних шахах або їх варіантах."
    },
    "checkers": {
        "name": "Шашка",
        "desc": "Ходить на одну клітинку по діагоналі вперед, б'є стрибаючи через фігуру по діагоналі у будь-якому напрямку. Не може перестрибувати фігури, коли не може бити. Її не має в шахах, але її силу можно оцінити в 0,5 пішака, оскільки вона дуже повільна і передбачувана.",
        "history": "Це спеціальна фігура, якої не має в звичайних шахах або їх варіантах."
    }
  }
}